---
kind: enumMember
id: F:Autodesk.Revit.DB.BeamSystemJustifyType.DirectionLine
enum: Autodesk.Revit.DB.BeamSystemJustifyType
source: html/2ab9e284-9fd9-eaac-ae59-c550fdcce372.htm
---
# Autodesk.Revit.DB.BeamSystemJustifyType.DirectionLine

DirectionLine.